Artillery/loadTest.yml
config:
  target: "http://localhost:4000"
  phases:
    - duration: 300
      arrivalRate: 150
  processor: "./randomNumber.js"
scenarios:
  - flow:
      - function: "randomNumber"
      - get:
          url: "/bookinglisting/?id={{ id }}"
      - post:
          url: "/bookinglisting"
          json:
            price: 999
            maxguests: 4
            minstay: 5